ch32-riscv-ug/ArduinoCore-CH32/libraries/SPI/src/SPI.h
/* SPI for CH32 RISC-V.
 *
 * Controller (master) mode, polled. The pins come from the variant's
 * CH32_SPIn_SCK/MISO/MOSI; chip select is not among them because Arduino
 * drives it as an ordinary GPIO, which is also what lets one bus carry several
 * devices.
 *
 * Peripheral (slave) mode is not implemented, so SPI_HAS_PERIPHERAL_MODE is
 * deliberately not defined - a library can test for it rather than discover it
 * at runtime.
 */
#pragma once

#include "api/HardwareSPI.h"
#include "ch32_pins.h"
#include "ch32_route.h"
#include "pins_arduino.h"

#include <stdint.h>

/* Legacy divider names. AVR's SPI.setClockDivider() took these, and enough
 * libraries still call it that leaving them out breaks compilation for no
 * gain. The divider is against F_CPU, as it is there. */
#define SPI_CLOCK_DIV2   2
#define SPI_CLOCK_DIV4   4
#define SPI_CLOCK_DIV8   8
#define SPI_CLOCK_DIV16  16
#define SPI_CLOCK_DIV32  32
#define SPI_CLOCK_DIV64  64
#define SPI_CLOCK_DIV128 128

namespace arduino {

class CH32SPIClass : public HardwareSPI {
public:
    CH32SPIClass(uint32_t base, uint32_t clken_addr, uint32_t clken_mask,
                 uint8_t sck_pin, uint8_t miso_pin, uint8_t mosi_pin,
                 uint32_t remap_mask, uint32_t remap_value,
                 uint32_t remap2_mask, uint32_t remap2_value)
        : _base(base), _clken_addr(clken_addr), _clken_mask(clken_mask),
          _sck_pin(sck_pin), _miso_pin(miso_pin), _mosi_pin(mosi_pin),
          _remap_mask(remap_mask), _remap_value(remap_value),
          _remap2_mask(remap2_mask), _remap2_value(remap2_value) {}

    void begin() override;
    void end() override;

    uint8_t transfer(uint8_t data) override;
    uint16_t transfer16(uint16_t data) override;
    void transfer(void *buf, size_t count) override;

    void beginTransaction(SPISettings settings) override;
    void endTransaction(void) override;

    /* Nothing to do: this driver never touches the bus from an interrupt, so
     * there is no shared state for an ISR to walk into. Declared because
     * HardwareSPI requires them, and because a library calling
     * usingInterrupt() must still compile. */
    void usingInterrupt(int interruptNumber) override { (void)interruptNumber; }
    void notUsingInterrupt(int interruptNumber) override { (void)interruptNumber; }
    void attachInterrupt() override {}
    void detachInterrupt() override {}

    /* Move this bus onto another of its pin routes. false, and nothing
     * changed, when the route does not exist on this series; setPins()
     * additionally refuses pins that do not all belong to one route, which is
     * the only thing the hardware can select. Calling either after begin()
     * reopens the bus and hands the old pads back as inputs. */
    bool setRoute(uint8_t route);
    bool setPins(uint8_t sck, uint8_t miso, uint8_t mosi);

    /* Pre-transaction API. Still used by a lot of library code. */
    void setBitOrder(BitOrder order);
    void setDataMode(uint8_t mode);
    void setClockDivider(uint32_t divider);

private:
    void apply(uint32_t clock_hz, BitOrder order, uint8_t mode);
    bool use_route(const ch32_route_t &route);

    const uint32_t _base;
    /* RCC enable register and bit, from the variant (clock_enables.csv). */
    const uint32_t _clken_addr;
    const uint32_t _clken_mask;
    /* Not const: setRoute()/setPins() move the bus between pin sets. */
    uint8_t _sck_pin;
    uint8_t _miso_pin;
    uint8_t _mosi_pin;
    /* AFIO route for these pins, written on every begin() - see
     * HardwareSerial::begin for why the default route is written too. */
    const uint32_t _remap_mask;
    uint32_t _remap_value;
    const uint32_t _remap2_mask;
    uint32_t _remap2_value;

    uint32_t _clock_hz = 4000000;
    BitOrder _order = MSBFIRST;
    uint8_t _mode = 0;
    bool _started = false;
};

}  // namespace arduino

/* Bus order, as everywhere else in the Arduino ecosystem: the bare name is the
 * first bus. */
#if defined(CH32_SPI1_SCK)
extern arduino::CH32SPIClass SPI;        /* SPI1 */
#if defined(CH32_SPI2_SCK)
extern arduino::CH32SPIClass SPI1;       /* SPI2 */
#endif
#if defined(CH32_SPI3_SCK)
extern arduino::CH32SPIClass SPI2;       /* SPI3 */
#endif
#elif defined(CH32_SPI2_SCK)
extern arduino::CH32SPIClass SPI;        /* SPI2, on a part with no SPI1 */
#if defined(CH32_SPI3_SCK)
extern arduino::CH32SPIClass SPI1;       /* SPI3 */
#endif
#endif
